In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# unique() method to find a unique values in a DataFrame and nunique() to retrieve the number of unique values 
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
#value_counts() method to get the number of occurance of each values in a column 
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
#apply() : using this method we can apply our customised built in functions 
def func_power2(x):
    return x**2
df['col1'].apply(func_power2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [9]:
len(df['col3'])

4

In [10]:
#to retrieve the length of each text element in a column 
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [11]:
# to retrieve some info about the column names and head of a dataframe 
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [14]:
df.index
#tells you start , stop and the stepsize of the indexes

RangeIndex(start=0, stop=4, step=1)

In [15]:
#sorting and Ordering the Dataframe by passing the column or axis to the method:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [16]:
# isnull() to find the null values in a dateframe 
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False